src/BusinessProcesses/Scan_Согласование/Scan_Согласование.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:BusinessProcess>
  <name>Scan_Согласование</name>
  <comment>Согласование (scania)</comment>
  <basedOn>Document.Scan_ЗаявкаНаДействие</basedOn>
  <basedOn>Document.Scan_Калькуляция</basedOn>
  <task>Task.ЗадачаИсполнителя</task>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Важность</name>
    <comment>Важность задач точки действия Выполнить для исполнителя</comment>
    <type>
      <types>EnumRef.Scan_Важность</types>
    </type>
  </attributes>
  <attributes>
    <name>ВариантСогласования</name>
    <type>
      <types>EnumRef.Scan_ВариантыСогласования</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗавершения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Наименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерИтерации</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПовторитьСогласование</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Предмет</name>
    <type>
      <types>DocumentRef.Scan_ЗаявкаПеревозчику</types>
      <types>DocumentRef.Scan_Калькуляция</types>
      <types>DocumentRef.Scan_ЗаявкаНаДействие</types>
    </type>
  </attributes>
  <attributes>
    <name>РезультатСогласования</name>
    <type>
      <types>EnumRef.Scan_РезультатыСогласования</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокИсполнения</name>
    <comment>в днях</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Шаблон</name>
    <type>
      <types>CatalogRef.Scan_ШаблоныСогласования</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Исполнители</name>
    <attributes>
      <name>Исполнитель</name>
      <type>
        <types>CatalogRef.РолиИсполнителей</types>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>Пройден</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РезультатыСогласования</name>
    <attributes>
      <name>ЗадачаИсполнителя</name>
      <type>
        <types>TaskRef.ЗадачаИсполнителя</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерИтерации</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РезультатСогласования</name>
      <type>
        <types>EnumRef.Scan_РезультатыСогласования</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РезультатыОзнакомлений</name>
    <attributes>
      <name>ЗадачаИсполнителя</name>
      <type>
        <types>TaskRef.ЗадачаИсполнителя</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерИтерации</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОтправленоНаПовторноеСогласование</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:BusinessProcess>

src/BusinessProcesses/Scan_Согласование/Forms/ФормаБизнесПроцесса/Module.bsl
//Rarus bonmak 28.07.2022 18726 добавил области

#Область ПроцедурыИФункцииОбщегоНазначения

Процедура ОбновлениеОтображения()
	Если Объект.Стартован Тогда
		ТолькоПросмотр = Истина;
		Элементы.ГруппаВариант.Доступность = Ложь;
		Элементы.ФормаЗаполнитьПоШаблону.Доступность = Ложь;
	КонецЕсли;
	//Если Важность = Перечисления.уатВажность.Высокая Тогда
	//	Элементы.Важность.ЦветТекста = WebЦвета.Красный;
	//ИначеЕсли Важность = Перечисления.уатВажность.Низкая Тогда
	//	Элементы.Важность.ЦветТекста = WebЦвета.Серый;
	//Иначе
	//	Элементы.Важность.ЦветТекста = ЦветаСтиля.ЦветТекстаПоля;
	//КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ДействияКомандныхПанелейФормы
&НаКлиенте
Процедура Карта(Команда)
	Если НЕ Объект.Ссылка.Пустая() Тогда
		ОткрытьФорму("БизнесПроцесс.Scan_Согласование.Форма.КартаМаршрута", Новый Структура("БизнесПроцесс", Объект.Ссылка), ЭтаФорма);
	Иначе
		//rarus FominskiyAS 24.04.2019  mantis 14191 +++
		//Сообщить("Бизнес-процесс не записан!", СтатусСообщения.Внимание);
		Сообщить(НСтр("ru = 'Бизнес-процесс не записан!'; en = 'A business process is not recorded!'"), СтатусСообщения.Внимание);
		//rarus FominskiyAS 24.04.2019  mantis 14191 ---  
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоШаблону(Команда)
	РезультатВыбора = Неопределено;

	ОткрытьФорму("Справочник.Scan_ШаблоныСогласования.ФормаВыбора",,,,,, Новый ОписаниеОповещения("ЗаполнитьПоШаблонуЗавершение", ЭтотОбъект), РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоШаблонуЗавершение(Результат, ДополнительныеПараметры) Экспорт
    
    РезультатВыбора = Результат;
    Если ТипЗнч(РезультатВыбора) = Тип("СправочникСсылка.Scan_ШаблоныСогласования") И Scan_ОбщегоНазначенияТиповые.ПолучитьЗначениеРеквизита(РезультатВыбора, "ЭтоГруппа") = ЛОЖЬ Тогда 
        ЗаполнитьПоШаблонуСервер(РезультатВыбора);
        Модифицированность = Истина;
    КонецЕсли;

КонецПроцедуры

&НаСервере                                           
Процедура ЗаполнитьПоШаблонуСервер(Шаблон)
	СогласованиеОбъект = РеквизитФормыВЗначение("Объект");
	СогласованиеОбъект.ЗаполнитьПоШаблону(Шаблон);
	ЗначениеВРеквизитФормы(СогласованиеОбъект, "Объект");
КонецПроцедуры

#КонецОбласти
  
#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ВсеЗадачиПередНачаломИзменения(Элемент, Отказ)
	Отказ = Истина;
	ПоказатьЗначение(Новый ОписаниеОповещения("ВсеЗадачиПередНачаломИзмененияЗавершение", ЭтотОбъект), Элементы.ВсеЗадачи.ТекущиеДанные.Ссылка);
КонецПроцедуры

&НаКлиенте
Процедура ВсеЗадачиПередНачаломИзмененияЗавершение(ДополнительныеПараметры) Экспорт
	Заглушка = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ПредметПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.Предмет) И (НЕ ЗначениеЗаполнено(Объект.Наименование) ИЛИ Объект.Наименование = "Согласовать ") Тогда 
		Объект.Наименование = "Согласовать """ + Объект.Предмет + """";
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ВсеЗадачи.Отбор, "БизнесПроцесс", Объект.Ссылка);
	Scan_СборСтатистики.Scan_ПриОткрытии("Бизнес-процессы", РеквизитФормыВЗначение("Объект").Метаданные().Синоним);	

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОбновлениеОтображения();
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ВсеЗадачи.Отбор, "БизнесПроцесс", Объект.Ссылка);
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Оповестить("БизнесПроцессИзменен", Объект.Ссылка);
	Если Объект.Стартован Тогда
		Оповестить("БизнесПроцессСтартован", Объект.Ссылка);
	КонецЕсли;
		
	ОбновлениеОтображения();
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	// Rarus tenkam 11.04.2022 mantis 18433 +++
	Если Объект.Ссылка.Пустая() Тогда
		Scan_СборСтатистики.Scan_ПередЗаписью("Бизнес-процессы", РеквизитФормыВЗначение("Объект").Метаданные().Синоним, Истина, "Создание нового элемента");
	КонецЕсли;
	// Rarus tenkam 11.04.2022 mantis 18433 --- 

КонецПроцедуры

#КонецОбласти
